app/Controllers/Admin/BeritaController.php

SELECT *
FROM `berita`
---
    public function index()
    {
        $model = new BeritaModel();
        $data['berita'] = $model->findAll(); // Mengambil semua data berita dari database

INSERT INTO `berita` (`gambar`, `judul`, `deskripsi`, `penulis`, `jadwal`) VALUES ('1728005504_19d0d766664c3b31903a.png', 'gambar apa ya', 'gambar database gaiss', 'bro althoff', '1333-12-31')
---
    public function store()
    {
        $model = new BeritaModel();
        $gambar = $this->request->getFile('gambar');

        if ($gambar->isValid() && !$gambar->hasMoved()) {
            $gambarName = $gambar->getRandomName();
            $gambar->move(WRITEPATH . 'uploads', $gambarName);
        } else {
            return redirect()->back()->with('error', 'Gagal mengupload gambar')->withInput();
        }

        $data = [
            'gambar' => $gambarName,
            'judul' => $this->request->getPost('judul'),
            'deskripsi' => $this->request->getPost('deskripsi'),
            'penulis' => $this->request->getPost('penulis'),
            'jadwal' => $this->request->getPost('jadwal'),
        ];
        $model->save($data);

SELECT *
FROM `berita`
WHERE `berita`.`id` = '11'
---
    public function edit($id)
    {
        $model = new BeritaModel();
        $data['berita'] = $model->find($id); // Mengambil berita berdasarkan ID

DELETE FROM `berita`
WHERE `id` IN ('12')
---
    public function delete($id)
    {
        $model = new BeritaModel();
        $model->delete($id); // Menghapus berita berdasarkan ID