app/Controllers/Login.php

    public function loginAction()
    {
        $session = session();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $userCheck = new UsersModel();
        $check = $userCheck->where('username',$username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1