app/Controllers/User.php

    public function catalog()
    {
        $beritaModel = new BeritaModel();
        $data['berita'] = $beritaModel->findAll(); // Mengambil semua data berita
---
SELECT *
FROM `berita`